{
    "bio": [
        "Hey, I'm Jilmer — a frontend developer who loves creating user-friendly web experiences. I've worked across a variety of projects, from modern web applications to interactive games with 10,000+ users. My favorite part of web development is making interfaces that *feel* great — whether it's a smooth user experience, design that works on any device, or intuitive UI that users love.",
        "I specialize in React, TypeScript, and modern frontend development, with expertise in responsive design, performance optimization, and scalable component architecture. I'm passionate about clean code, accessibility, and shipping features that actually make a difference to users.",
        "When I'm not coding, you'll probably find me lifting weights, reading about UX design principles, or exploring new frontend technologies for inspiration. I'm always learning and always building."
    ],
    "short_summary": "Frontend developer with 5+ years of experience specializing in React, TypeScript, and modern web development. Led development of web applications and interactive games reaching 10,000+ users with focus on responsive design, performance optimization, and scalable architecture.",
    "portfolio_url": "https://jjbc-portfolio.netlify.app/",
    "github_url": "https://github.com/jjbc-ocm",
    "technologies": [
        "React",
        "TypeScript",
        "JavaScript",
        "HTML",
        "CSS",
        "Material UI",
        "Responsive Design",
        "Node.js",
        "GitHub",
        "GitLab",
        "Cursor",
        "ChatGPT",
        "Colyseus",
        "Unity",
        "C#"
    ],
    "highlights": [
        {
            "icon": "Build",
            "text": "12+ major frontend features shipped across web applications"
        },
        {
            "icon": "Devices",
            "text": "Mobile-first responsive design for 10,000+ users"
        },
        {
            "icon": "Speed",
            "text": "Optimized frontend performance and reduced load times by 50%"
        }
    ],
    "education": [
        {
            "degree": "Bachelor of Science in Computer Science",
            "school": "Our Lady of Fatima University, QC Campus",
            "duration": "2015 - 2019"
        }
    ],
    "references": [
        {
            "name": "",
            "contacts": []
        }
    ]
}